#include <stdio.h>

/*5. Използвайте функцията getchar(), с която въвеждате текст от
клавиатурата, докато не подадете ЕОF(‘?’). Текстът има букви и
цифри. Принтирайте с putchar() само въведените букви. Използвайте
условните оператори, за да принтирате с putchar() само малките
букви от латинската азбука а z и големите букви A Z.*/


int main(void){
    char text;
    

    while((text = getchar()) != EOF){
        if(((text >= 'a') && (text <= 'z'))  || ((text >= 'A') && (text <= 'Z'))){          
            putchar(text);
        }
    }
        
}
       
