/*Задача
3 . Да се построи наредено двоично дърво за
търсене чрез последователно добавяне на следните
върхове*/

#include "tree.h"

treeNode_t *root = NULL;
treeNode_t *z = NULL;



int main(void){
    int Arr1[13] = {7,14,28,35,65,12,18,42,81,64,61,4,13};
    int Arr2[13] = {12,7,14,81,42,18,61,4,64,35,13,28,65};
    int Arr3[13] = {4,7,12,13,14,18,28,35,42,61,64,65,81};
    int Arr4[13] = {81,65,64,42,35,28,18,14,13,12,7,4};
    int Arr5[13] = {28,64,13,42,7,81,61,4,12,65,35,18,14};
    
    

    int s;
    for (s = 0; s < 13;s++){
        insert(Arr3[s]);
    }
    z = root;
    preorder(z);
}