/*Задача 10.
Как работи? Дефинираме променлива “а“, дефинираме
пойнтер, но още не му задаваме стойност. Отпечатайте
адреса на “а”. След това присвояваме стойност на
пойнтера, като внимаваме типовете на пойнтера и
променливата да са от един и същи тип. Отпечатваме
на екрана стойността на пойнтера с %р, стойността на
„а“ с %d, стойността на *ptr с %*/


#include <stdio.h>

int main(void){
    int a;
    int *ptr;
    printf("%X\n",&a);
    /*printf("%*",*ptr);*/
    *ptr = &a;
    printf("%p\n",ptr);
    printf("%d",a);
    printf("%*",*ptr);
    return 0;
}



