/*Задача 11.
Напишете програма, която умножава 2 числа, като
използва пойнтер и.
Пойнтер
ите не са страшни. Дефинират се като
тип *Х и се използват като *Х. Както променливите,
но със * отпред (и 1 наум!).
Продължение: Опитайте да умножите 2 променливи от
различен тип, използвайки пойнтери. */

#include <stdio.h>

int main(void){
    int a = 10;
    int b = 20;
    int *pA = &a;
    int *pB = &b;
    char c = '1';
    char *pC = &c;
    int result = (*pA) * (*pB);
    printf("%i\n",result);

    printf("%i", ((*pC)* (*pA)));
    return 0;
}