/*Задача 7.
Направете програма, в която инициализирате пойнтер към
променлива и след това изчислявате сбор на променливата
(използвайки пойнтера) + 5. Отпечатайте на*/

#include <stdio.h>


int main(void){
    int a = 100;
    int *p = &a;
    *p += 5;
    printf("%i",a);
    return 0;
}